{
	"item.hexical.lamp": "Genie Lamp",
	"item.hexical.arch_lamp": "Archgenie Lamp",
	"item.hexical.conjured_staff": "Conjured Staff",
	"block.hexical.mage_block": "Mage Block",

	"subtitles.hexical.lamp_activate": "Lamp activates",
	"subtitles.hexical.lamp_deactivate": "Lamp deactivates",

	"hexcasting.spell.hexical:program_lamp": "Educate Genie",
	"hexcasting.spell.hexical:get_lamp_position": "Genie Refl.: Spatial",
	"hexcasting.spell.hexical:get_lamp_rotation": "Genie Refl.: Rotational",
	"hexcasting.spell.hexical:get_lamp_velocity": "Genie Refl.: Kinetic",
	"hexcasting.spell.hexical:get_lamp_use_time": "Genie Refl.: Temporal",
	"hexcasting.spell.hexical:get_arch_lamp_position": "Archgenie Refl.: Spatial",
	"hexcasting.spell.hexical:get_arch_lamp_rotation": "Archgenie Refl.: Rotational",
	"hexcasting.spell.hexical:get_arch_lamp_velocity": "Archgenie Refl.: Kinetic",
	"hexcasting.spell.hexical:get_arch_lamp_use_time": "Archgenie Refl.: Temporal",
	"hexcasting.spell.hexical:get_arch_lamp_storage": "Archgenie Refl.: Memory",
	"hexcasting.spell.hexical:set_arch_lamp_storage": "Archgenie Gambit",
	"hexcasting.spell.hexical:is_using_lamp": "Archgenie Purification",
	"hexcasting.spell.hexical:terminate_arch_lamp": "Archgenie Termination",
	"hexcasting.spell.hexical:chorus_blink": "Chorus Blink",
	"hexcasting.spell.hexical:conjure_staff": "Conjure Staff",
	"hexcasting.spell.hexical:conjure_mage_block": "Conjure Mage Block",
	"hexcasting.spell.hexical:modify_block_bouncy": "Modify Block: Bouncy",
	"hexcasting.spell.hexical:modify_block_ephemeral": "Modify Block: Ephemeral",
	"hexcasting.spell.hexical:modify_block_invisible": "Modify Block: Invisible",
	"hexcasting.spell.hexical:modify_block_replaceable": "Modify Block: Replaceable",
	"hexcasting.spell.hexical:modify_block_volatile": "Modify Block: Volatile",
	"hexcasting.spell.hexical:surveil_sentinel": "Surveil Sentinel",
	"hexcasting.spell.hexical:nephthys": "Nephthys Gambit",

	"hexcasting.mishap.bad_block.advanced_conjured_block": "an advanced conjured block",
	"hexcasting.mishap.hexical:needs_lamp": "Expected to be cast by Genieless Lamp.",
	"hexcasting.mishap.hexical:needs_active_arch_lamp": "Expected to have an active Arch Genieless Lamp.",

	"hexical.page.hexical_changes.title": "Hexical Changes",
	"hexical.page.hexical_changes.0": "The media feels friendlier somehow. I feel strangely more receptive of the ambient media around me. I can even feel it responding to certain tasks I perform, as if new spells are available to me.",
	"hexical.page.hexical_changes.1": "The media has also become more adaptable, letting me manipulate it more precisely into specialized effects and even interface with items like my abacus.",

	"hexical.category.lamp": "Genieless Lamp",
	"hexical.category.lamp.desc": "I have heard tales from the villagers about a magical artifact. Legends say it contains a spirit that grants wishes, but I suspect that is just embellishment evolved over centuries of storytelling. Regardless, I dedicate this chapter to my pursuit and research of it.",

	"hexical.page.mysterious_lamp.title": "Mysterious Lamp",
	"hexical.page.mysterious_lamp.0": "At last I've discovered the subject of a thousand years of rumor! To think a mere wandering trader was in possession of such a strong artifact. The lamp emanates a vague residue of media, vacuous in feeling... it reminds me of the $(o)hollow media structure$() of a focus that enables it to store iota, but there is also a presence inside with spellcasting capabilities similar to my own.",
	"hexical.page.mysterious_lamp.1": "I've developed a pattern to educate the entity inside of my intentions. Because I am teaching an entity my will rather than inherently etching a casting device with it, I believe I should be able to freely overwrite the hex inside at any time.",

	"hexical.page.new_possibilities.title": "New Possibilities",
	"hexical.page.new_possibilities.0": "It casts $(o)$(l)EVERY INSTANT$(). After writing a spell into it, I was treated to a splendid gush of media. I estimate the casting speed must be around twenty times every second. The presence inside the lamp performs the casting on my behalf with extraordinary efficiency, not producing the sound and particles that accompany other casting methods.",
	"hexical.page.new_possibilities.1": "I have developed some useful patterns for use with the lamp, documented on the next few pages.",

	"hexical.page.replacement_mind.title": "Replacement Mind",
	"hexical.page.replacement_mind.0": "Hex casting burns out the mind from the energy of thought, flooding the consciousness, inundating every neuron... it's euphoric. For staffs, casting devices, and spell circles, the rate of casting is slow enough that a mind can recuperate; I will never need to replace my mind or an impetus. With the speeds this lamp operates at, though, even an optimized mind can only bear the burden for so long. Luckily, the lamp is able to somehow support the mind until its media battery runs out, where the genie finally perishes and the lamp visibly tarnishes. In these cases, the genie must be... replaced.",
	"hexical.page.replacement_mind.1": "Basing off the shape of the other genie patterns and the $(o)feeling$() of the media, I have developed this highly specialized pattern that extracts the mind of a villager and transforms it into a genie. The stress of nonstop casting requires highly trained villagers, I estimate of Journeyman-class or greater. The lamp may not be recharged without sacrificing a new mind, discarding the previous genie in the process, so I should aim to gather as much media as I can before casting.",

	"hexical.page.arch_lamps.title": "Arch Lamps",
	"hexical.page.arch_lamps.0": "Because a separate mind casts my spells, a lamp should be able to cast even without me holding it. I estimate any villager short of a complete master of its field would be unable to cast so often unassisted though. These $(o)arch lamps$() are activated and deactivated rather than used and while they're active in my inventory, they will cast every moment without my input.",
	"hexical.page.arch_lamps.1": "The output of a arch lamp is so grand that it saturates the air around me with media... it's incredible. Unfortunately, if two lamps are active at once within my inventory, the resonances clash and deactivate both lamps, as well as rendering every arch lamp in my inventory useless for a few seconds. To prevent such a mishap, I should only have one arch lamp active at once, although I can still simutaneously use a regular lamp.",

	"hexical.page.get_lamp_position": "Pushes the original position of the caster when the lamp started casting.",
	"hexical.page.get_lamp_rotation": "Pushes the original rotation of the caster when the lamp started casting.",
	"hexical.page.get_lamp_velocity": "Pushes the original velocity of the caster when the lamp started casting.",
	"hexical.page.get_lamp_use_time": "Pushes how many times the lamp has casted. Divided by 20, it returns how many times in seconds the lamp has been in use.",

	"hexical.page.get_arch_lamp_position": "Pushes the original position of the caster when the arch lamp started casting. Can be cast by casting items or staff.",
	"hexical.page.get_arch_lamp_rotation": "Pushes the original rotation of the caster when the arch lamp started casting. Can be cast by casting items or staff.",
	"hexical.page.get_arch_lamp_velocity": "Pushes the original velocity of the caster when the arch lamp started casting. Can be cast by casting items or staff.",
	"hexical.page.get_arch_lamp_use_time": "Pushes how many times the lamp has casted. Divided by 20, it returns how many times in seconds the lamp has been in use. Can be cast by casting items or staff.",
	"hexical.page.is_using_lamp": "Takes a player and pushes whether they currently have an active arch lamp.",
	"hexical.page.terminate_arch_lamp": "Casted by a casting device, staff, or within the arch lamp, deactivates the lamp's operation. Similar to Charon's.",

	"hexical.page.arch_lamp_storage": "Arch Lamp Storage",
	"hexical.page.set_arch_lamp_storage": "The arch lamp also supports an iota storage similar to the Ravenmind, which this pattern sets.",
	"hexical.page.get_arch_lamp_storage": "Supporting the last one, this pattern sets the iota storage of my current active lamp. Unlike the Ravenmind, this pattern is subject to the Transgress Others mishap.",

	"hexical.page.hexical_metaevals": "Hexical Meta-evaluations",
	"hexical.page.nephthys.0": "Pops a pattern list and a number from the stack and dives down n iota to casts the pattern list. Useful for surgery-like operations.",
	"hexical.page.nephthys.1": "It's extremely versatile and I can mend almost any error in my stack using Bookkeeper's Gambit, pushing iota after a dive, and transforming surfaced iota. It was named after a goddess of mourning and rivers, lending to how it buries/dives down into the stack.",

	"hexical.page.mage_block.title": "Mage Blocks",
	"hexical.page.mage_block": "While interesting, Conjure Block has multiple shortcomings. The blocks last forever, are consequently a pain to clean up, and lack interesting properties. Luckily, Nature offers an elegant and flexible solution. These mage blocks come with a suite of $(o)modifiers$(). I could even stack multiple modifiers on one block.",
	"hexical.page.conjure_mage_block": "Conjures a generic mage block at the location. Costs three dust.",
	"hexical.page.modify_block_bouncy": "This modifier makes the block delightfully fun to bounce on! It returns more force to me than regular slime blocks and I notice even if I sneak, the block bounces me regardless.",
	"hexical.page.modify_block_ephemeral": "This modifier takes in a number as well as a position and makes the block destroy itself after the number in twentieths of a second has passed. No more messy floating blocks!",
	"hexical.page.modify_block_invisible": "This modifier prevents the block from emiting the telltale particles, even when being stood on.",
	"hexical.page.modify_block_replaceable": "This modifier is useful for construction! With this modifier applied, I find I can easily place another block in the place of a conjured block.",
	"hexical.page.modify_block_volatile": "This modifier makes the block break other conjured blocks it's touching. Notably, if it breaks another volatile block, the chain continues down until every volatile block shatters.",

	"hexical.page.chorus_blink.0": "Between Blink, Greater Teleport, ender pearls, and chorus fruit, this spell serves a harmonious midpoint for safe, precise, and cheap teleportation.",
	"hexical.page.chorus_blink.1": "It consumes a chorus fruit from my inventory and teleports me up to 16 blocks using an offset vector. The cost is constant whether I teleport the full 16 blocks or less, and has no penalty for multiple casts in one hex. With a lot of chorus fruit, it can be a significantly cheaper Greater Teleport.",

	"hexical.page.conjure_staff.0": "Conjures a staff at the location with the amount of media, rank, and hex respectively.",
	"hexical.page.conjure_staff.1": "A conjured staff is not unlike a cypher. It has a media bank that it relies on for casting and breaks when it runs out, unable to consume my health or my inventory's media. It is not rechargable or programmable. Using erase item on it simply destroys it. However, its true power is $(o)input interception$().",
	"hexical.page.conjure_staff.2": "When I use my primary or secondary use keys with a staff in my main hand, it intercepts my click. Depending on the rank I assigned during creation, after that many clicks, it will cast the hex I gave it, starting the stack with false and true, corresponding to my left and right clicks respectively.",
	"hexical.page.conjure_staff.3": "The spell is not cheap, requiring a charged amethyst, the media battery, and an additional amethyst shard for every additional rank. However, the conjured result is both speedy and versatile, with infinitely more possibilities and none of the cooldown of other casting devices."
}
