{
	"block.hexical.mage_block": "Mage Block",
	"entity.hexical.speck": "Speck",
	"key.categories.hexical": "Hexical",
	"key.hexical.telepathy": "Telepathy",
	"item.hexical.lamp": "Genie Lamp",
	"item.hexical.arch_lamp": "Archgenie Lamp",
	"item.hexical.grimoire": "Grimoire",
	"item.hexical.conjured_staff": "Conjured Staff",
	"itemGroup.hexical.general": "Hexical",
    "particle.minecraft.soul_7": "Soul",
	"subtitles.hexical.lamp_activate": "Lamp activates",
	"subtitles.hexical.lamp_deactivate": "Lamp deactivates",

	"hexcasting.mishap.bad_block.mage_block": "a mage block",
	"hexcasting.mishap.bad_item.lamp": "an empty lamp",
	"hexcasting.mishap.bad_item.lamp_flay": "a villager of Journeyman status or greater",
	"hexcasting.mishap.bad_item.speck": "a speck",
	"hexcasting.mishap.hexical:needs_lamp": "Expected to be cast by Genieless Lamp.",
	"hexcasting.mishap.hexical:needs_arch_lamp": "Expected to have an active Arch Genieless Lamp.",
	"hexcasting.mishap.hexical:grimoire_access_denied": "Tried to increase the uses of a restricted binding.",
	"hexcasting.mishap.hexical:grimoire_too_full": "Tried to fit too many bindings in a grimoire.",

	"hexcasting.spell.hexical:get_telepathy": "Telepathic Reflection",
	"hexcasting.spell.hexical:send_telepathy": "Send Thought",
	"hexcasting.spell.hexical:shout_telepathy": "Shout Thought",
	"hexcasting.spell.hexical:pling": "Hallucinate Pling",
	"hexcasting.spell.hexical:click": "Hallucinate Click",

	"hexcasting.spell.hexical:conjure_speck": "Conjure Speck",
	"hexcasting.spell.hexical:move_speck": "Move Speck",
	"hexcasting.spell.hexical:rotate_speck": "Rotate Speck",
	"hexcasting.spell.hexical:iota_speck": "Iota Speck",
	"hexcasting.spell.hexical:lifetime_speck": "Lifetime Speck",
	"hexcasting.spell.hexical:size_speck": "Size Speck",
	"hexcasting.spell.hexical:thickness_speck": "Thickness Speck",
	"hexcasting.spell.hexical:kill_speck": "Dismiss Speck",
	"hexcasting.spell.hexical:zone_speck": "Zone Dstl.: Speck",

	"hexcasting.spell.hexical:write_grimoire": "Write Grimoire",
	"hexcasting.spell.hexical:erase_grimoire": "Erase Grimoire",
	"hexcasting.spell.hexical:index_grimoire": "Archivist Reflection",
	"hexcasting.spell.hexical:restrict_grimoire": "Restrict Grimoire",
	"hexcasting.spell.hexical:query_grimoire": "Archivist Purification",

	"hexcasting.spell.hexical:make_genie": "Make Genie",
	"hexcasting.spell.hexical:educate_genie": "Educate Genie",
	"hexcasting.spell.hexical:lamp_finale": "Finale Reflection",
	"hexcasting.spell.hexical:get_lamp_position": "Genie Refl.: Spatial",
	"hexcasting.spell.hexical:get_lamp_rotation": "Genie Refl.: Rotational",
	"hexcasting.spell.hexical:get_lamp_velocity": "Genie Refl.: Kinetic",
	"hexcasting.spell.hexical:get_lamp_use_time": "Genie Refl.: Temporal",
	"hexcasting.spell.hexical:get_lamp_media": "Genie Refl.: Media",
	"hexcasting.spell.hexical:get_arch_lamp_position": "Arch. Refl.: Spatial",
	"hexcasting.spell.hexical:get_arch_lamp_rotation": "Arch. Refl.: Rotational",
	"hexcasting.spell.hexical:get_arch_lamp_velocity": "Arch. Refl.: Kinetic",
	"hexcasting.spell.hexical:get_arch_lamp_use_time": "Arch. Refl.: Temporal",
	"hexcasting.spell.hexical:get_arch_lamp_media": "Arch. Refl.: Media",
	"hexcasting.spell.hexical:get_arch_lamp_storage": "Arch. Refl.: Memory",
	"hexcasting.spell.hexical:set_arch_lamp_storage": "Archgenie Gambit",
	"hexcasting.spell.hexical:has_arch_lamp": "Archgenie Purification",
	"hexcasting.spell.hexical:terminate_arch_lamp": "Archgenie Termination",

	"hexcasting.spell.hexical:chorus_blink": "Chorus Blink",
	"hexcasting.spell.hexical:conjure_staff": "Conjure Staff",

	"hexcasting.spell.hexical:conjure_mage_block": "Conjure Mage Block",
	"hexcasting.spell.hexical:modify_block_bouncy": "Modify Block: Bouncy",
	"hexcasting.spell.hexical:modify_block_ephemeral": "Modify Block: Ephemeral",
	"hexcasting.spell.hexical:modify_block_invisible": "Modify Block: Invisible",
	"hexcasting.spell.hexical:modify_block_replaceable": "Modify Block: Replaceable",
	"hexcasting.spell.hexical:modify_block_volatile": "Modify Block: Volatile",

	"hexcasting.spell.hexical:get_weather": "Meterologist's Refl.",
	"hexcasting.spell.hexical:block_hardness": "Miner's Purification",
	"hexcasting.spell.hexical:block_blast_resistance": "Demoman's Purification",
	"hexcasting.spell.hexical:is_burning": "Inferno Purification",
	"hexcasting.spell.hexical:burning_time": "Inferno Purification II",
	"hexcasting.spell.hexical:is_wet": "Enderman's Purification",
	"hexcasting.spell.hexical:is_sleeping": "Sloth's Purification",
	"hexcasting.spell.hexical:is_sprinting": "Racer's Purification",

	"hexcasting.spell.hexical:nephthys": "Nephthys Gambit",

	"hexical.page.hexical_changes.title": "Hexical Changes",
	"hexical.page.hexical_changes.0": "I feel strangely more in tune with the ambient media around me. It feels $(o)friendlier$() somehow... I can even feel it rippling, responding to my actions, as if suggesting new spells to me. The media itself also feels more malleable, more $(o)workable$(), allowing me to manipulate it into precise specialized effects.",
	"hexical.page.hexical_changes.1": "I also find my tools more familar. I notice I require less concentration with my staff and can move around while using it, handy for chasing down targets that get out of my line of sight before I can finish my raycast. I shouldn't become too relaxed though, Nature has not become more forgiving of my mistakes. I can also write directly into my abacus with Scribe's Gambit.",

	"hexical.page.grimoire.title": "Grimoires",
	"hexical.page.grimoire.0": "By encrusting my spellbook with charged amethyst and edified wood, it traps media within the pages like an echo chamber. I can then introduce a pattern-to-pattern-list binding for the grimoire to keep bouncing endlessly inside.",
	"hexical.page.grimoire.1": "When I then cast the pattern associated with a pattern list with my staff and the grimoire in my inventory, it empowers the pattern, allowing it to break free from the grimoire's pages with a faint sound of a hex being cast. This allows me to create $(o)shortcuts$() for my staff by associating a short pattern with a common task, such as the raycast mantra. Interestingly, the grimoire can even overwrite base patterns, allowing me to hijack and add extra functionality to them.",
	"hexical.page.grimoire.2": "While stable with only a few strands of media wizzing around inside, a single grimoire can not hold more than sixteen pattern associations. When attempting to introduce more, the grimoire simply rejects it and throws itself onto the ground with a shower of blue sparks.",
	"hexical.page.grimoire.3": "I can also restrict a pattern inside the grimoire so it destroys itself after a certain number of uses. I shall find this aspect of the grimoire quite useful if I ever need to lend out my true name. I can simply give them a grimoire a set number of references to my name.",
    "hexical.page.write_grimoire": "Writes a pattern-to-pattern-list binding into the grimoire in my offhand.",
    "hexical.page.erase_grimoire": "Erases the pattern-list binding to the pattern in the grimoire in my offhand if it exists.",
	"hexical.page.index_grimoire": "Gets a list of all patterns stored in the grimoire.",
	"hexical.page.restrict_grimoire": "Restrict a grimoire binding to be only usable that number of times, mishaps if you attempt to increase the uses.",
	"hexical.page.query_grimoire": "Gets how many times you can use that grimoire binding before it erases itself.",

	"hexical.category.lamp": "Genieless Lamp",
	"hexical.category.lamp.desc": "I have heard tales from the villagers about a magical artifact. Legends say it contains a spirit that grants wishes, but I suspect that is just embellishment evolved over centuries of storytelling. Regardless, I dedicate this chapter to my pursuit and research of it.",

	"hexical.page.mysterious_lamp.title": "Mysterious Lamp",
	"hexical.page.mysterious_lamp.0": "At last I've obtained the subject of a thousand years of rumor! To think a mere wandering trader was in possession of such a strong artifact. The oil lamp emanates a vague residue of media, vacuous in feeling... it reminds me of the $(o)hollow media structure$() of a $(l:items/focus)focus$() that allows it to store iota. There is also a presence inside with casting capabilities similar to my own.",
	"hexical.page.mysterious_lamp.1": "Teaches the presence my intentions. Because I am $(o)teaching$() an entity rather than $(o)etching$() a casting device, I can freely revise the hex and reteach the genie any time without losing the media.",

	"hexical.page.new_possibilities.title": "New Possibilities",
	"hexical.page.new_possibilities.0": "It casts $(o)$(l)EVERY INSTANT$(). After writing a spell into it, I was treated to a splendid unceasing gush of media. I estimate the casting speed must be around twenty times every second. The presence inside the lamp performs the casting with extraordinary efficiency, not producing most of the sound and particles that accompany other casting methods.",
	"hexical.page.new_possibilities.1": "I have developed some useful patterns for use with the lamp, documented on the next few pages. These patterns should only be cast by the genie within the lamp, lest I succumb to the Impersonate Genie mishap, which emits red sparks and yanks my casting item from my hand.",
	"hexical.page.get_lamp_position": "Pushes my original position when I began using the lamp.",
	"hexical.page.get_lamp_rotation": "Pushes my original rotation when I began using the lamp.",
	"hexical.page.get_lamp_velocity": "Pushes my original velocity when I began using the lamp.",
	"hexical.page.get_lamp_use_time": "Pushes how many times the lamp has casted. Divided by 20, it is the number of seconds since I began using the lamp.",
	"hexical.page.get_lamp_media": "Pushes the remaining media of the lamp in dust, in terms of dust.",
	"hexical.page.lamp_finale.0": "The instant I let go of my lamp, it casts twice: once for the usual cast and a second time as a final burst of media. I can use this pattern to recognize whether a cast is that finale, and react accordingly.",

	"hexical.page.replacement_mind.title": "Replacement Mind",
	"hexical.page.replacement_mind.0": "Hex casting burns out the mind from the energy of thought, flooding the consciousness, inundating every neuron... it's euphoric. For staffs, casting devices, and spell circles, the rate of casting is slow enough that a mind can recuperate; I will never need to replace an impetus. With the speeds lamps operates at, though, even an optimized mind can only bear the burden for so long.",
	"hexical.page.replacement_mind.1": "Luckily, the lamp somehow sustains the mind until its media battery runs out, where the genie finally perishes. In these cases, the lamp must be... reloaded.",
	"hexical.page.replacement_mind.2": "I have developed this highly specialized pattern that extracts the mind of a villager and transforms it into a genie. The stress of nonstop casting requires highly trained minds, I estimate of Journeyman-grade or greater. The lamp may not be recharged without sacrificing a new mind, discarding the previous genie, so I should aim to gather as much media as I can before casting. The pattern itself costs five charged amethyst.",

	"hexical.page.arch_lamps.title": "Arch Lamps",
	"hexical.page.arch_lamps.0": "Because a separate mind casts my spells, a lamp should be able to cast even without me holding it. I estimate any villager short of a complete master of its field would be unable to cast so often unassisted though. These $(o)arch lamps$() are activated and deactivated rather than used and while active in my inventory, they cast every moment even without my input.",
	"hexical.page.arch_lamps.1": "The output of an arch lamp is so grand that it saturates the air around me with media... it's incredible. Unfortunately, if two lamps are active at once within my inventory, the resonances clash and deactivate both lamps, as well as rendering every arch lamp in my inventory useless for a few seconds. I should only have one archgenie lamp active at once, although I can still simutaneously use a regular lamp.",
	"hexical.page.lamp_finale.1": "When a master lamp is turned off, it casts an additional time. I can use this pattern to recognize when whether a cast is that last burst of energy.",
	"hexical.page.get_arch_lamp_position": "Pushes the original position of the caster when the arch lamp started casting.",
	"hexical.page.get_arch_lamp_rotation": "Pushes the original rotation of the caster when the arch lamp started casting.",
	"hexical.page.get_arch_lamp_velocity": "Pushes the original velocity of the caster when the arch lamp started casting.",
	"hexical.page.get_arch_lamp_use_time": "Pushes how many times the lamp has casted. Divided by 20, it returns how many times in seconds the lamp has been in use.",
	"hexical.page.get_arch_lamp_media": "Pushes the remaining amount of media left in the lamp, in terms of dust.",
	"hexical.page.has_arch_lamp": "Pushes whether a player currently has an active arch lamp.",
	"hexical.page.terminate_arch_lamp": "Can be casted by a casting device, staff, or within the arch lamp itself. Deactivates the lamp's operation, similar to Charon's.",

	"hexical.page.arch_lamp_storage.title": "Arch Lamp Memory",
	"hexical.page.arch_lamp_storage": "An archgenie can remember an iota, persisting between casts. If I need to save an iota between casts of the lamp, I can stash it in its memory. The two patterns responsible for interacting with the memory can also be cast by a staff or casting device if an arch lamp is active.",
	"hexical.page.set_arch_lamp_storage": "Sets the lamp's iota storage. Subject to Transgress Others mishap.",
	"hexical.page.get_arch_lamp_storage": "Gets the lamp's iota storage.",

	"hexical.page.nephthys.title": "Nephthys' Gambit",
	"hexical.page.nephthys.0": "Pops a pattern list and a number from the stack and dives down n iota to casts the pattern list. Useful for surgery-like operations.",
	"hexical.page.nephthys.1": "It's extremely versatile and I can mend almost any error in my stack using Bookkeeper's Gambit, pushing iota after a dive, and transforming surfaced iota. It was named after a goddess of mourning and rivers, lending to how it buries/dives down into the stack.",

    "hexical.page.telepathy.title": "Telepathy",
    "hexical.page.telepathy": "Media is the energy of thought and consequently, it can interact with thoughts as well. Unfortunately or perhaps fortunately for me, the minds of players are too resistant to be swayed by hexes and even the minds of villagers resist tampering. There is a notable exception though: my own mind is open to my own media, allowing me to read and write thoughts.",
    "hexical.page.get_telepathy": "By focusing on a particular image, I can detect that concentration via this telepathy spell. This pattern pushes how long I have been holding down the G key, or null if I am not holding it.",
    "hexical.page.send_telepathy": "Momentarily displays the iota above my hotbar above my hotbar. If cast repeatedly, each cast overwrites the previous message instantly.",
    "hexical.page.shout_telepathy": "Displays a iota across my screen. I find it can get annoying since it obstructs my vision, so I shall only use it sparingly.",
	"hexical.page.pling": "Causes me to hear a pling sound that is inaudible to other players.",
	"hexical.page.click": "Causes me to hear a click sound that is inaudible to other players.",

	"hexical.page.chorus_blink.0": "Between Blink, Greater Teleport, ender pearls, and chorus fruit, this spell serves a harmonious midpoint for safe, precise, and cheap teleportation.",
	"hexical.page.chorus_blink.1": "It consumes a chorus fruit from my inventory and teleports me up to 16 blocks using an offset vector. The cost is constant whether I teleport the full 16 blocks or less, and has no penalty for multiple casts in one hex. With a lot of chorus fruit, it can be a significantly cheaper Greater Teleport.",

	"hexical.page.mage_block.title": "Mage Blocks",
	"hexical.page.mage_block": "The blocks from Conjure Block last forever, are consequently a pain to clean up, and are not too versatile. Luckily, Nature offers an elegant and flexible alternative. These mage blocks come with a suite of $(o)modifiers$(). I could even stack multiple modifiers on one block.",
	"hexical.page.conjure_mage_block": "Conjures a mage block at the location. Costs three dust, which is threefold more expensive than the regular Conjure Block.",
	"hexical.page.modify_block_bouncy": "This modifier makes the block delightfully fun to bounce on! It returns more force to me than regular slime blocks and I notice even if I sneak, the block bounces me regardless.",
	"hexical.page.modify_block_ephemeral": "This modifier takes in a number as well as a position and shatters the block after the number in twentieths of a second has passed. Subsequent casts can lengthen or shorten the duration.",
	"hexical.page.modify_block_invisible": "This modifier prevents the block from emitting the telltale particles that accompany my casting, even when being stood on.",
	"hexical.page.modify_block_replaceable": "This modifier is useful for construction! With this modifier applied, I find I can easily place another block in the place of the mage block.",
	"hexical.page.modify_block_volatile": "This modifier makes the block break other conjured blocks it's touching. Notably, if it breaks another volatile block, that block breaks and so on until every volatile block shatters.",

	"hexical.page.specks.title": "Specks",
    "hexical.page.specks.0": "I can conjure an image of an iota into the world, called a speck. Nature allows me to customize them quite extensively, altering their size, thickness of stroke, and more. They also take on my pigment color. Once they are in the world, I can move, rotate, and otherwise alter them for free.",
    "hexical.page.conjure_speck": "Conjures a speck with the iota, position, and rotation. Costs one-hundredth of a dust.",
    "hexical.page.move_speck": "Moves a speck entity to the position.",
    "hexical.page.rotate_speck": "Rotates a speck entity to face the vector.",
    "hexical.page.iota_speck": "Changes the speck's iota.",
    "hexical.page.lifetime_speck": "Changes the speck to disappear after that many twentieths of a second.",
    "hexical.page.size_speck": "Changes the size of the speck, must be less than 10.",
    "hexical.page.thickness_speck": "Changes the thickness of the speck, must be less than 5. Applies only when iota is a pattern.",
    "hexical.page.kill_speck": "Forces a speck entity to disappear.",
    "hexical.page.zone_speck": "Returns specks similarly to other $(l:patterns/entities)zone distillation$() patterns.",

	"hexical.page.world_scrying.title": "World Scrying",
	"hexical.page.world_scrying": "I have discovered some additional patterns to scry information about the world. These are highly specialized for specific tasks, like checking the weather and block hardness.",
	"hexical.page.get_weather": "Pushes a number corresponding to the weather. 0 for clear, 1 for rain, and 2 for thundering.",
	"hexical.page.block_hardness": "Pushes how hard the block is to mine.",
	"hexical.page.block_blast_resistance": "Pushes how resistant the block is to explosions.",
	"hexical.page.is_burning": "Pushes whether the entity is burning. Also applies to entities that are visually on fire, even if they are immune to fire like blazes attacking.",
	"hexical.page.burning_time": "Pushes how long the entity will continue burning if not put out.",
	"hexical.page.is_wet": "Pushes whether the entity is touching rain, water, or in a bubble column.",
	"hexical.page.is_sleeping": "Pushes whether the entity is sleeping. Applies to players, cats, foxes, and a variety of other creatures.",
	"hexical.page.is_sprinting": "Pushes whether the entity is sprinting. Includes if I am swimming or if I have left the ground since sprinting, extends to cats, foxes, and more.",

	"hexical.page.conjure_staff.0": "Conjures a staff at the location with the amount of media, rank, and hex respectively.",
	"hexical.page.conjure_staff.1": "Conjured staves are not unlike cyphers. They have a media battery for casting and when they run out, unable to consume my health or my inventory's stash for media. They are not rechargable or reprogrammable, and using Erase Item on it simply destroys it. However, its true power is $(o)input interception$().",
	"hexical.page.conjure_staff.2": "When I use my primary or secondary use keys while holding a conjured staff, it intercepts my click. After a number of clicks corresponding to the rank I assigned at conjuration, it will cast the hex I gave it, starting the stack with false and true, corresponding to the left and right clicks respectively. If I pause for too long between clicks, it simply cancels the current \"cast\".",
	"hexical.page.conjure_staff.3": "The spell is not too expensive, requiring only an amethyst shard, an amethyst dust for every rank, and the media for the battery. The result is a speedy and versatile casting device, with infinitely more possibilities and no cooldown compared to other casting devices."
}
